Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This is a reference to an AntBuilder instance.
zh_cn: 它指向一个 AntBuilder实例。

source: This is a simple way to 'implement' the FileCollection interface.
zh_cn: 这是 “实现” FileCollection接口的简单方法。

source: This is a stand alone user interface that can be launched with the --gui option.
zh_cn: 这是一个独立的用户界面，可以通过加上 --gui 参数来启动。

source: This is accessible from a build script, or an init script, or via the embedding API.
zh_cn: 它可以从构建脚本，init 脚本，或者是通过内嵌的 API 访问。

source: This is an alternative to configuration injection.
zh_cn: 这是配置注入的另一种方法。

source: This is an example of convention-over-configuration via a reasonable default.
zh_cn: 这是通过一个合理的默认的约定优于配置的例子。

source: This is because these keywords are used in a build.gradle file, which defines a project.
zh_cn: 这是因为这些关键字在 build.gradle 文件中使用，而这个文件定义了一个project。

source: This is called when the contents of the collection are queried, and its return value is converted to a set of File instances.
zh_cn: 它会在查询集合内容，并且它的返回值被转换为一组文件实例时被调用。

source: This is changing with new services like Bintray that let developers host and distribute their release binaries using a self-service repository platform.
zh_cn: 这种状况通过一些新的服务也改变了，比如Bintray ，它可以让开发者使用自助服务的仓库平台托管和分发他们发布的二进制文件。

source: This is described in more detail in Section 50.4, “How to declare your dependencies”.
zh_cn: 这在 50.4章节，“如何声明你的依赖关系”有更详细的描述。

source: This is discussed in more detail in the following sections.
zh_cn: 这一点将在以下各节中详细讨论。

source: This is done as follows:
zh_cn: 以如下方式进行：

source: This is done by comparing published SHA1 values in the repository with the SHA1 values for existing downloaded artifacts.
zh_cn: 这是通过比较发布在仓库中的 SHA1 值和现在已经下载好的工件的 SHA1 值来完成的。

source: This is done using the PlatformConfigurableToolChain API.
zh_cn: 它通过 PlatformConfigurableToolChain API来完成。

source: This is done using the following criteria:
zh_cn: 它使用以下标准来完成：

source: This is done without requiring a separate artifact file store per repository.
zh_cn: 这不需要让一个单独的文件在每一个仓库中存储就可以做到。

source: This is expected to yield another significant speedup for Scala compilation.
zh_cn: 这将会为 Scala 编译带来另一个方面上的明显加速。

source: This is expressed as taskB.mustRunAfter(taskA).
zh_cn: 这被表示为 taskB.mustRunAfter(taskA) 。

source: This is extremely useful because it drives consistency across projects; the consistency regarding naming conventions of archives and their location after the build completed.
zh_cn: 这是非常有用的，因为它促进了跨项目的一致性 ；完成了有关构件命名规范及构建之后的位置上的一致。

source: This is interpreted as a relative path.
zh_cn: 这被解释为相对路径。

source: This is not without problems.
zh_cn: 这不是没有问题的。

source: This is often the case with Maven SNAPSHOT artifacts, but can also be true for any artifact which is republished without changing it's identifier.
zh_cn: 这种常见的情况是 Maven 的快照构件，但任何构件也都可以不改变它的标识符而重新发布。

source: This is really different to what you are used to with Ant targets.
zh_cn: 这是真正的与你所使用的 Ant 目标（target）的不同之处。

source: This is reflected in the structure of the Maven POM. We think there are many situations where it makes sense to have more than one artifact per project.
zh_cn: 这也反映在 Maven POM 的结构中。我们认为在很多情况下，有意义一个项目有超多一个的构件。

source: This is similar to the way we would normally configure objects in Java.
zh_cn: 这类似于我们通常在 Java 中配置对象的方式。

source: This is so unrelated tasks may share an output directory without interfering with each other.
zh_cn: 这是不相关的任务可以在不互相干扰的情况下共用一个输出目录。

source: This is to shield you from false security.
zh_cn: 这是为了使你不会误以为测试通过。

source: This is useful for creating, say, a custom build command that explicitly skips tests, documentation, and samples that you could call "fast build".
zh_cn: 它用于创建一个自定义的命令，来显示地跳过测试，文档，例子。你可以称之为“快速构建”。

source: This is useful if your project requires some extra setup that is done inside another batch file or shell script (such as specifying an init script).
zh_cn: 这是很有用的。如果你的项目需要在另一个批处理文件或 shell 脚本中做一些额外的配置（比如指定一个初始化脚本）。

source: This is useful when you are developing custom Gradle tasks or plugins in Groovy.
zh_cn: 当你在开发自定义 Gradle 任务或在 Groovy 中的插件时将会很有用。

source: This is useful when you are developing custom Gradle tasks or plugins.
zh_cn: 当你在开发自定义 Gradle 任务或插件时将会很有用。

source: This is very handy for example for adding dependencies not needed for building or testing your software (e.g. additional JDBC drivers to be shipped with your distribution).
zh_cn: 这是非常方便的，例如添加依赖时不需要构建或测试你的软件（比如，将会与发布的软件一起的额外的 JDBC 驱动程序）。

source: This launching of an extra JVM on every build execution is quite expensive, which is why we highly recommend that you use the Gradle Daemon if you are specifying org.gradle.java.home or org.gradle.jvmargs.
zh_cn: 在执行每个构建时运行一个额外的 JVM 的代价是非常昂贵的，这就是为什么我们强烈推荐您使用 Gradle 守护进程，如果你指定了org.gradle.java.home或org.gradle.jvmargs。

source: This lies at the heart of Gradle and makes many things possible which would not be possible otherwise.
zh_cn: 这是 Gradle 的核心，它使得很多事情由不可能变得可能。

source: This makes identifying the parameter values for a particular iteration easy.
zh_cn: 这使得在特定的迭代过程，很容易确定参数值。

source: This makes incremental migration to Gradle much easier than the alternative.
zh_cn: 这使得增量迁移到 Gradle 比其他的要容易得多。

source: This makes it possible to use the best language for the job, and to rewrite any class in the other language if needed.
zh_cn: 这样一来，我们就能够在项目中使用最适合的语言，并且在有需要的情况下用其他的语言重写其中的任何类。

source: This makes it unnecessary to execute the clean task explicitly.
zh_cn: 这样一来，我们就没有必要显式执行 clean 任务。

source: This makes metadata rules another instrument for customizing dependency resolution.
zh_cn: 这使得元数据成为自定义依赖解析的另一种手段。

source: This means neither httpclient nor commons-codec is added to your WAR, even if commons-codec were an explicit dependency of your compile configuration.
zh_cn: 这意味着 httpclient 和 commons-codec 都不会添加到你的 WAR 中，即使 commons-codec 是 compile 配置上的一个显示依赖。

source: This means that 2 tasks from the same project are never executed in parallel.
zh_cn: 这意味着同一个项目的两个任务都永远不会被执行。

source: This means that Gradle itself has to be run with Java 6 or higher.
zh_cn: 这意味着 Gradle 本身要使用 Java 6 或其以上版本。

source: This means that Gradle must launch a separate JVM process to execute the build after parsing the various gradle.properties files.
zh_cn: 这意味着 Gradle 在分析了各种gradle.properties文件之后，必须启动一个单独的 JVM 进程，以执行构建操作。

source: This means that all of the properties and methods declared by the Script interface are available in your script.
zh_cn: 这意味着所有由该Script接口声明的属性和方法在您的脚本中是可用的。

source: This means that even if some daemon is idle but you are running the build with a different version of Gradle, a new daemon will be started.
zh_cn: 这意味着即使一些守护进程处于空闲状态，但您正在运行的构建与 Gradle 不同版本，也将启动一个新的守护进程。

source: This means that if a given test class is executed by multiple test tasks, then the test report will include executions of that class, but it can be hard to distinguish individual executions of that class and their output.
zh_cn: 这意味着，如果一个给定的测试类被多个test任务所执行，那么测试报告将包括那个类的所有执行结果，但它难以区分那个类的每次执行和它们的输出。

source: This means that if you want to upload your signatures to your distribution repository along with the artifacts you simply execute the uploadArchives task as normal.
zh_cn: 这意味着，如果你想要将你的签名以及artifacts上传到你的分布仓库中，正常来讲你只需要执行uploadArchives任务。

source: This means that the 'newest' conflict resolution strategy would still select version 1.3 if this version was also pulled transitively.
zh_cn: 这意味着，如果这个版本也因依赖传递被获取到，“使用最新”的冲突解决策略仍然会选择 1.3 版本。

source: This means that the JAR is available in the classpath of a dependent project.
zh_cn: 这意味着这个JAR文件被包含在一个依赖它的项目的类路径中。

source: This means that the closure we are passing gets evaluated after the build scripts of the subproject are evaluated.
zh_cn: 这意味着我们所传的闭包在子项目的构建脚本评估之后才被评估。

source: This means that the inclusion of the path 'services:hotels:api' will result in creating 3 projects: 'services', 'services:hotels' and 'services:hotels:api'.
zh_cn: 这意味着，包含路径 'services:hotels:api' 将导致创建3个项目: 'services'、'services:hotels'和'services:hotels:api'。

source: This means that using any form of shared build script logic or configuration injection (allprojects, subprojects, etc.) will cause your projects to be coupled.
zh_cn: 这意味着，使用任何形式的共享构建脚本逻辑或配置注入（allprojects、subprojects等）会导致你的项目耦合。

source: This means that when a single task, from a single project is requested, all projects of multi-project build are configured first.
zh_cn: 这意味着，当从一个项目请求一个任务时，首先会配置多项目构建的所有项目。

source: This means that when resolving against one repository Gradle will never overwrite the cached artifact file from a different repository.
zh_cn: 这意味着，当对一个存储库解析时，Gradle 将永远不会覆盖从一个不同的仓库中缓存的构件文件。

source: This means that whenever you are using the STS Gradle plugin for Eclipse or the Gradle support in Intellij IDEA, you're already using the Gradle Daemon.
zh_cn: 这意味着当您在 Eclipse中使用 STS Gradle 或在 Intellij IDEA 中使用 Gradle 支持时，您已经在使用 Gradle 守护进程。

source: This means the default Gradle log level will not show any Ant/Ivy output unless it is an error or a warning.
zh_cn: 这意味着默认情况下， Gradle 日志级别将不会显示任何 Ant/Ivy 的输出，除非是错误或警告信息。

source: This means they cannot be used outside the current build, but they can be used with the same build.
zh_cn: 这意味着它们不能在当前的构建外使用，但它们可以在同一个构建中使用。

source: This means you can manipulate and execute the Ant targets in exactly the same way as Gradle tasks.
zh_cn: 这意味着你可以用与 Gradle 任务完全相机的方式操纵和执行 Ant 目标。

source: This means you can set the property using, for example, a File, String, collection, FileCollection or even a closure.
zh_cn: 这意味着您可以通过如File、String、 集合、 FileCollection对象，或甚至是一个闭包来设置此属性。

source: This means you can, for example, create a FileCollection that represents files which will be created in the future by, say, some task.
zh_cn: 这意味着您可以，比如创建一个FileCollection 对象而里面的文件会在以后才创建，比方说在一些任务中才创建。

source: This mechanism has been superseded by 'Test Filtering', described above.
zh_cn: 这种机制已经被上述的“测试过滤”所取代。

source: This mechanism is very powerful and flexible.
zh_cn: 这一机制非常强大和灵活。

source: This metadata typically originates in the module's descriptor.
zh_cn: 这个元数据通常来源于模块的描述符。

source: This method accepts a task instance, a task name or any other input accepted by Task.dependsOn().
zh_cn: 这个方法接受一个任务实例、 任务名称或Task.dependsOn()所接受的任何其他输入作为参数。

source: This might be a library or a ZIP distribution or any other file.
zh_cn: 它可能是一个库，一个 ZIP 文件，或者是任何其他文件。

source: This mystery jar was a necessary transitive, fourth-level dependency that was easy to miss because no one had bothered to use managed transitive dependencies.
zh_cn: 这个神秘的 jar 包是一个必需传递的，第四级的依赖，很容易被忽略，因为没有人会费心去使用托管的传递依赖。

source: This new behavior is implemented in a bandwidth and storage efficient way.
zh_cn: 这一新行为通过带宽和存储空间的有效途径被实现。

source: This override always forces the output to be shown.
zh_cn: 它会始终强制显示输出。

source: This plugin does not add any tasks.
zh_cn: 此插件不会添加任何任务。

source: This plugin extends the Java plugin to add Groovy compilation capabilities to your project.
zh_cn: 该插件扩展了Java插件，对你的项目增加了Groovy的编译功能.

source: This plugin is automatically applied if you use the Java plugin.
zh_cn: 这个Base插件会在你使用 Java 插件时自动的添加进来。

source: This plugin provides a new DSL to support publishing artifacts to Ivy repositories, which improves on the existing DSL.
zh_cn: 这个插件提供了新的 DSL，用于支持发布文件到 Ivy 存储库，改善了现有的 DSL。

source: This plugin provides a new DSL to support publishing artifacts to Maven repositories, which improves on the existing DSL.
zh_cn: 这个插件提供了新的 DSL，用于支持发布文件到 Maven 存储库，改善了现有的 DSL。

source: This practice also reduces the potential for error.
zh_cn: 这种做法也减少了潜在的错误。

source: This process can be done in parts over time, and you can have a working Gradle build during the entire process.
zh_cn: 这个过程可以随着时间一点点完成，并且在这整个过程当中你的 Gradle 构建都可以使用用。

source: This process is described in Chapter 51, Publishing artifacts
zh_cn: 这一过程在第 51章，发布文件中会讲到。

source: This project is simply a Groovy project that produces a JAR containing the task class.
zh_cn: 这个项目只是一个简单的Groovy项目，它将产生一个包含任务类的JAR包。

source: This project produces and publishes a JAR which you can then use in multiple builds and share with others.
zh_cn: 这个项目会输出和发布一个JAR文件，然后你可以在多个构建中使用，并且分享出去。

source: This provides you with an alternate way to launch Gradle commands.
zh_cn: 这为你提供了启动 Gradle 命令行的替代方法。

source: This recursive pattern of transitive dependencies results in a tree of dependencies including your project's first-level dependencies, second-level dependencies, and so on.
zh_cn: 这种递归模式传递依赖的结果是，在一个依赖树中，会包含你的项目的第一级依赖、第二级依赖，等等。

source: This rule implementation can be neatly encapsulated in a corporate plugin, and shared across all builds within the organisation.
zh_cn: 该规则实现可以整齐地封装在一个公司的插件中，并在组织内和所有构建共享。

source: This section outlines the Gradle project's recommended best practices for managing dependencies.
zh_cn: 本节概述 Gradle 项目推荐的管理依赖的最佳实践。

source: This snapshot contains the set of input files and a hash of the contents of each file.
zh_cn: 这个快照包含了输入文件集和每个文件的内容的哈希值。

source: This snapshot contains the set of output files and a hash of the contents of each file.
zh_cn: 该快照包含输出文件集和每个文件的内容的哈希值。

source: This solution will include a Visual Studio Project for that component, as well as linking to project files for each depended-on binary.
zh_cn: 这个方案包含了一个该组件的 Visual Studio Project ，并且为每一个依赖的二进制文件链接到项目文件中。

source: This source set should contain the cunit test files for the component sources.
zh_cn: 这个源码集应包含组件源码的 cunit 测试文件。

source: This specification is used by the installApp and distZip tasks as the specification of what is to be include in the distribution.
zh_cn: 这个描述在 installApp 和 distZip 任务中会用到，作为这个distribution 都包含了什么内容的描述。

source: This strategy enforces that all version conflicts are resolved explicitly in the build script.
zh_cn: 这种策略强制在构建脚本中明确地解决所有的版本冲突。

source: This task depends on all the archives task of the archives configuration.
zh_cn: 这个任务依赖于archives配置的所有archives任务。

source: This task doesn't do anything useful, so let's add some behaviour.
zh_cn: 这个任务没有进行任何有用的操作，所以让我们来添加一些行为。

source: This task is only added to the root project.
zh_cn: 此任务仅添加到根项目。

source: This task will generate a Visual Studio Solution file for the named component.
zh_cn: 这个任务会为所命名的组件生成一个 Visual Studio Solution 文件。

source: This topic is also the most intellectually challenging.
zh_cn: 本主题也是最具智力挑战性的。

source: This type is used when no type was explicitly specified, and no type could be inferred.
zh_cn: 如果没有显示地指定一个类型，或者无法推断出类型时，会使用该类型。

source: This type of task is good for implementing one-off tasks in your build script.
zh_cn: 这个类型的任务适合于实现在构建脚本中只执行一次的任务。

source: This type will be automatically inferred if such a file exists.
zh_cn: 如果存在这样的文件，将会自动推断此类型。

source: This was all about simple tasks.
zh_cn: 这都是简单的任务。

source: This way the default tasks behave correctly when projects are configured on demand.
zh_cn: 这种方式当项目按需配置时默认任务的行为正确。

source: This way the dependency declaration is more explicit.
zh_cn: 这种依赖声明的方式更加明确。

source: This way the typical common configuration is supported (allprojects or subprojects script blocks).
zh_cn: 这种方式的典型常见配置已经支持（allprojects 或subprojects 脚本块）。

source: This way you can force Gradle to rebuild the cache.
zh_cn: 通过这种方式，您可以强制 Gradle 重新生成缓存。

source: This way, the configuration time of a large multi-project build is greatly improved.
zh_cn: 这种方式，大大提高了大型多项目构建的配置时间。

source: This will add following tasks to the project:
zh_cn: 这将向项目添加下列任务：

source: This will also apply the Java plugin to the project, if it has not already been applied.
zh_cn: 这段代码同时会将Java插件应用到project中，如果Java插件还没被应用的话。

source: This will always involve a remote lookup on the repository, however in many cases no download will be required (seeSection 50.9.1.3, “Artifact reuse”, below).
zh_cn: 这将始终涉及到存储库中的远程查找，然而，在许多情况下都没有下载的需要（见第 50.9.1.3 节，“构件重用”下文）、。

source: This will cause the distribution archives to be created with a different name.
zh_cn: 这将导致分发的 archives 以不同的名字创建。

source: This will create a task (of type Sign) in your project named “signArchives”, that will build any archives artifacts (if needed) and then generate signatures for them.
zh_cn: 这将在你的项目中创建一个名为“signArchives”的任务（Sign类型），这个任务会构建任何archives的artifacts（如果需要），然后为它们生成签名。

source: This will create a task (of type Sign) in your project named “signStuffZip”, that will build the input task's archive (if needed) and then sign it.
zh_cn: 这将在您的项目创建一个名为“signStuffZip”的（Sign类型） 的任务，这个任务会构建输入任务的archive（如果需要），并进行签字。

source: This will make the test task only use the includes / excludes to find test classes.
zh_cn: 这将使test任务只使用includes / excludes 来找到测试类。

source: This works by converting the POM to one or more Gradle files.
zh_cn: 这是通过将 POM 转换为一个或多个 Gradle 文件。

source: This works for any task.
zh_cn: 这种方式适用于任何任务。

source: This works independent of the project's source directory layout.
zh_cn: 它的分析独立于项目的源目录布局。

source: This works regardless of the project's source directory layout.
zh_cn: 这个过程与project 的源目录布局无关。

source: This yields a hierarchical view in the Sonar web interface with aggregated metrics and the ability to drill down into subprojects.
zh_cn: 它能够在 Sonar 的 web 界面生成一个层次图，该层次图包含了综合的指标且能够深入到子项目中。

source: This yields a hierarchical view in the Sonar web interface, with aggregated metrics and the ability to drill down into subprojects.
zh_cn: 它能够在 Sonar 的 web 界面生成一个层次图，该层次图包含了综合的指标且能够深入到子项目中。

source: Those configurations have the same scope as the respective compile and runtime configurations, except that they are not added to the WAR archive.
zh_cn: 虽然它们有各自的compile和runtime配置，但这些配置有相同的作用域，只是它们不会添加到 WAR 文件中。

source: Those directories need to exist as siblings of the root project directory.
zh_cn: 这些目录必须存在，并且与根项目目录同级。

source: Those elements also provide build-by-convention support for Java, Groovy, OSGi, Web and Scala projects.
zh_cn: 这些元素同样也为 Java, Groovy, OSGi, Web 和 Scala 项目提供了基于约定的构建。

source: Those levels are QUIET and LIFECYCLE.
zh_cn: 这两个级别分别是 QUIET 和 LIFECYCLE.

source: Those tasks assemble and upload the artifacts belonging to the specified configuration.
zh_cn: 这些任务组装并上传属于指定的配置的构件。

source: Those tasks assemble the artifacts belonging to the specified configuration.
zh_cn: 这些任务组装成属于指定配置的构件。

source: Those tasks form a Directed Acyclic Graph.
zh_cn: 这些任务形成一个有向无环图。

source: Those tasks generate exactly the same content as the command line reports triggered by gradle tasks, gradle dependencies and gradle properties (see Section 11.6, “Obtaining information about your build”).
zh_cn: 这些任务生成内容，与由gradle tasks， gradle dependencies和gradle properties触发的命令行报告的内容完全相同（见第 11.6 节，“获取有关您的构建的信息”）。

source: Thus providing concise, maintainable and comprehensible builds.
zh_cn: 因此，它提供了简明、可维护和易理解的构建。

source: To access a Maven repository which uses basic authentication, you specify the username and password to use when you define the repository:
zh_cn: 要访问一个使用基本的身份验证的 Maven 仓库，当你在定义该仓库时要指定使用的用户名和密码：

source: To access a configuration:
zh_cn: 如果要访问配置：

source: To access a descriptor you can do:
zh_cn: 你可以这样访问一个描述符：

source: To access a repository:
zh_cn: 若要访问一个仓库：

source: To access an Ivy repository which uses basic authentication, you specify the username and password to use when you define the repository:
zh_cn: 要访问一个使用基本的身份验证的 Ivy 仓库，当你在定义该仓库时要指定使用的用户名和密码：

source: To access the mapping configuration you can say:
zh_cn: 要访问映射配置，你可以：

source: To accommodate that place the META-INF/application.xml in the right place inside your source folders (see the appDirName property).
zh_cn: 去把 META-INF/application.xml 放在你的源文件夹里的正确的位置（请查看 appDirName 属性）。

source: To achieve this, you can specify that signing is only required under certain conditions.
zh_cn: 要做到这一点，你可以指定只在一定条件下才要求签名。

source: To add additional content to the POM, the pom.project builder can be used.
zh_cn: 如果要向 POM 添加其他的内容，可以使用pom.project 生成器。

source: To add another bean elements to its parent, you use a closure.
zh_cn: 如果要添加另一个bean元素到它的parent，你可以使用一个闭包。

source: To add any kind of repository (you can pretty easy write your own ones) you can do:
zh_cn: 要添加任何一种仓库 (你可以很简单地编写你自己的) ，你可以：

source: To add some files as a dependency for a configuration, you simply pass a file collection as a dependency:
zh_cn: 如果想添加一些文件作为配置的依赖，你只需要传一个文件集合作为依赖：

source: To add the JCenter Maven repository (http://jcenter.bintray.com) simply add this to your build script:
zh_cn: 若要添加 JCenter Maven 仓库（http://jcenter.bintray.com），只需添加下面的内容到你的构建脚本中：

source: To add the central Maven 2 repository (http://repo1.maven.org/maven2) simply add this to your build script:
zh_cn: 若要添加中央 Maven 2 仓库（http://repo1.maven.org/maven2），只需添加下面的代码到你的构建脚本中：

source: To adjust memory settings, configure scalaCompileOptions.forkOptions as needed:
zh_cn: 如果要调整内存设置，请根据需要配置scalaCompileOptions.forkOptions ：

source: To analyze a project hierarchy, apply the Sonar Runner plugin to the root project of the hierarchy.
zh_cn: 要分析一个项目的层次结构， 需要把 Sonar Runner 插件应用于层次结构的最顶层项目。

source: To analyze a project hierarchy, the Sonar plugin needs to be applied to the top-most project of the hierarchy.
zh_cn: 要分析项目的层次结构， 需要把 Sonar 插件应用于层次结构的最顶层项目。

source: To analyze code written in a language other than Java, install the corresponding Sonar plugin, and set sonar.project.language accordingly:
zh_cn: 要分析非 Java 语言编写的代码，请安装相应的Sonar 插件，并相应地设置sonar.project.language ：

source: To build a Groovy project, you use the Groovy plugin.
zh_cn: 要构建一个Groovy项目，你需要使用Groovy插件。

source: To build a WAR file, you apply the War plugin to your project:
zh_cn: 要构建一个WAR文件，你需要在你的项目当中应用War插件：

source: To build an executable binary, an Executable component is added to the executables container and associated with a set of sources.
zh_cn: 为构建一个可执行的二进制，Executable组件添加到executables容器中，并与源码集相关联。

source: To build either a static or shared native library binary, a Library component is added to the libraries container.
zh_cn: 为构建一个静态或共享的原生库二进制文件，一个Library组件将添加到libraries容器中。

source: To change how long Gradle will cache the meta-data and artifacts for a changing module, use:
zh_cn: 要修改 Gradle 对变化模块的元数据和构件的缓存时间，请使用：

source: To change how long Gradle will cache the resolved version for a dynamic version, use:
zh_cn: 如果要改变Gradle对解析一个动态版本的缓存时间，可以使用：

source: To change the log level for standard out or error during task execution, tasks also provide a LoggingManager.
zh_cn: 为能在任务执行过程中更改标准输出或错误的日志级别，task也提供了一个 LoggingManager。

source: To change the the default configuration order to be bottom up, That means that a project configuration depends on the configuration of its child projects, the evaluationDependsOnChildren() method can be used.
zh_cn: 如果要把默认配置的顺序改为从下到上，这意味着项目配置将会依赖于它的子项目的配置，可以使用evaluationDependsOnChildren()方法。

source: To completely overwrite existing Eclipse files, execute a clean task together with its corresponding generation task, for example gradle cleanEclipse eclipse (in that order).
zh_cn: 若要完全覆盖现有 Eclipse 文件，请执行clean任务和其相应的生成任务，例如gradle cleanEclipse eclipse (按此顺序)。

source: To completely overwrite existing IDEA files, execute a clean task together with its corresponding generation task, for example gradle cleanIdea idea (in that order).
zh_cn: 若要完整覆盖现有 IDEA 文件，请执行clean任务和其相应的生成任务，例如gradle cleanIdea idea (按此顺序)。

source: To configure a configuration:
zh_cn: 配置一个配置：

source: To configure a repository:
zh_cn: 要配置一个仓库：

source: To configure an existing source set, you simply use one of the above access methods to set the properties of the source set.
zh_cn: 要配置一个现有的源集，你只需使用上面的其中一种访问方法来设置源集的属性。

source: To configure on demand just for given build please see Appendix D, Gradle Command Line.
zh_cn: 只对指定的构建按需配置，请参见附录 D， Gradle 命令行。

source: To configure on demand with every build run see Section 20.1, “Configuring the build environment via gradle.properties”.
zh_cn: 要在每次构建时都按需配置，请参阅第 20.1 节，“通过 gradle.properties配置构建环境”。

source: To configure the simple attributes you pass a map to the bean elements.
zh_cn: 你可以传一个map到bean元素中，来配置简单的属性。

source: To create a Copy task for your build, you can declare in your build script:
zh_cn: 若要创建Copy任务，您可以在构建脚本中声明：
